{
  "start": {
    "text": "Вечером после работы так не хочется идти на пары — вокруг темно и не видно ничего-ничего. Хочется вместо этого пойти домой, включить новогодний фильм и есть сладости под ёлкой. Но вместо этого вы идете в вуз \n\nПальцы мёрзнут, но вы открываете приложение на телефоне, чтобы посмотреть, где пары. Главный экран приложения приветствует вас по имени: «Добрый день!»",
    "choices": [
      {
        "text": "Продолжить",
        "next": "player_name"
      }
    ]
  },
  "player_name": {
    "text": "Кстати, как вас зовут? Напишите ваше имя:",
    "choices": [
      {
        "text": "Ввести имя",
        "next": "introduction"
      }
    ]
  },
  "introduction": {
    "text": "Сегодня пары по критическому мышлению в первом корпусе. Порадовавшись, что не придётся долго идти, вы уже подходите к кампусу. Но странное дело! Перед корпусом толпа людей, полиция, журналисты, а главное - нет высокой украшенной ёлки, к которой вы уже привыкли за прошедшие недели.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "journalist"
      }
    ]
  },
  "journalist": {
    "text": "Один из журналистов замечает ваше удивление и подходит ближе.\n\n— Вы же здесь учитесь, верно? Не могли бы вы дать комментарий для нашего телеграм-канала?",
    "choices": [
      {
        "text": "Поговорить с журналистом",
        "next": "talk_to_journalist"
      },
      {
        "text": "Отказаться от разговора",
        "next": "refuse"
      }
    ]
  },
  "refuse": {
    "text": "— Нет, извините, я опаздываю на пару. \n\nЖурналист ещё хочет что-то сказать, но вы уже заходите в корпус. Самое время - до пары около 10 минут.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "wardrobe_refuse"
      }
    ]
  },
  "talk_to_journalist": {
    "text": "— Да, конечно, а что рассказать?\n\nЖурналист обрадовался вашей отзывчивости и сразу начал расспрашивать вас — где учитесь, на какой программе, видели ли раньше эту ёлку, как отнеслись к утрате. Другой журналист снимает вас на телефон. Вы подробно отвечаете на вопросы, а в конце желаете подписчикам счастливого Нового года и заходите в корпус. Пара уже началась, поэтому вы спешите.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "wardrobe_accept"
      }
    ]
  },
  "wardrobe_refuse": {
    "text": "Оставляя одежду в гардеробе, вы замечаете, что другие студенты перешептываются. Несмотря на другие украшения в холле, новогоднего настроения почти и нет. Вы берёте номерок, подходите к турникету, сканируете пропуск из приложения и проходите в корпус.",
    "choices": [
      {
        "text": "Войти в аудиторию",
        "next": "in_class_v1"
      }
    ]
  },
  "wardrobe_accept": {
    "text": "Оставляя одежду в гардеробе, вы замечаете, что другие студенты перешептываются. Несмотря на другие украшения в холле, новогоднего настроения почти и нет. Вы берёте номерок, подходите к турникету, сканируете пропуск из приложения и проходите в корпус. Приходится быстро идти, чтобы не опоздать ещё больше.",
    "choices": [
      {
        "text": "Войти в аудиторию",
        "next": "in_class_v2"
      }
    ]
  },
  "in_class_v1": {
    "text": "Вы заходите в аудиторию. Преподаватель уже настраивает проектор, но у вас ещё есть время, чтобы выбрать подходящее место и сесть.\n\nКуда вы сядете?",
    "choices": [
      {
        "text": "Подальше от преподавателя",
        "next": "far_seat_v1"
      },
      {
        "text": "На первый ряд",
        "next": "close_seat_v1"
      }
    ]
  },
  "far_seat_v1": {
    "text": "Вы киваете преподавателю и садитесь на предпоследний ряд. Пропавшая ёлка не даёт вам покоя - что бы это могло быть? Как можно её украсть?",
    "choices": [
      {
        "text": "Продолжить",
        "next": "research_cross"
      }
    ]
  },
  "close_seat_v1": {
    "text": "Вы здороваетесь и занимаете место перед преподавателем. Пропавшая ёлка не даёт вам покоя - что бы это могло быть? Как можно её украсть?",
    "choices": [
      {
        "text": "Продолжить",
        "next": "fake_news_cross"
      }
    ]
  },
  "in_class_v2": {
    "text": "Чуть-чуть запыхавшись, вы заходите в аудиторию. Преподаватель, прерывая речь на пару секунд, внимательно смотрит на вас, но ничего не говорит и продолжает лекцию.\n\nА вам нужно выбрать, где сесть.",
    "choices": [
      {
        "text": "Подальше от преподавателя",
        "next": "far_seat_v2"
      },
      {
        "text": "На первый ряд",
        "next": "close_seat_v2"
      }
    ]
  },
  "far_seat_v2": {
    "text": "Вы садитесь на предпоследний ряд. Преподаватель всё равно далеко, поэтому вы достаёте ноутбук. Пропавшая ёлка не даёт вам покоя — что бы это могло быть? Как можно её украсть?",
    "choices": [
      {
        "text": "Продолжить",
        "next": "research_cross"
      }
    ]
  },
  "close_seat_v2": {
    "text": "Преподаватель бросает на вас ещё один взгляд — вы загораживаете презентацию части студентов. Вы стараетесь как можно быстрее занять своё место.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "fake_news_cross"
      }
    ]
  },
  "fake_news_cross": {
    "text": "Тема лекции сегодня — фейковые новости и способы их обнаружения. Понимая, что кража ёлки похожа на сенсацию для сплетен, вы спрашиваете преподавателя:\n\n— Скажите, а как лучше всего распознавать фейки?\n— Для начала я бы советовал вам посмотреть, на кого ссылаются журналисты. Есть ли имена авторов цитат? Упоминались ли факты, о которых они писали, где-то ещё? И так далее. То есть, не верьте ни одному факту, пока его не подтвердите. И постарайтесь мыслить критически, в любой ситуации.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "fire_alarm_cross1"
      }
    ]
  },
  "research_cross": {
    "text": "Может, поискать информацию в интернете? Или всё-таки послушать лекцию?",
    "choices": [
      {
        "text": "Послушать лекцию",
        "next": "listen_lecture_cross"
      },
      {
        "text": "Поискать информацию",
        "next": "find_info_cross"
      }
    ]
  },
  "listen_lecture_cross": {
    "text": "Вы решаете послушать лекцию и открываете документ с конспектами пары. Стараетесь всё записывать, чтобы ничего не пропустить.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "fire_alarm_cross1"
      }
    ]
  },
  "fire_alarm_cross1": {
    "text": "После пары вы, казалось, уже забыли о журналистах и ёлке. Сейчас для вас важно узнать, как готовить итоговую работу для экзамена. Вы стоите в толпе других студентов перед преподавателем и ждёте свою очередь, чтоб задать вопрос. Даже не стали брать рюкзак с вашего места. Внезапно включается пожарная тревога. Вы, как и другие студенты, не понимаете, что происходит.\n\n— Выходим! Все вопросы — потом, в чате! — кричит преподаватель.\n\nНо вы мешкаете — бежите за рюкзаком и спешно собираете вещи.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "corridor_cross"
      }
    ]
  },
  "corridor_cross": {
    "text": "Когда вы выходите в коридор, не видите уже ничего вокруг. Кругом только какой-то странный туман.\n\nВдали стоит странный мужчина. Но что это у него в руках? Какой-то странный топор?\n\nУ вас не так много выборов. Можно пойти вниз по лестнице или подать знаки человеку, дождаться и поговорить с ним. Очевидно, что он хочет вас спасти и дойти вдоль по коридору. Что же делать?",
    "choices": {
      "variants": {
        "default": [
          {
            "text": "Побежать к лестнице вперёд",
            "next": "go_stairs_ahead_cross"
          },
          {
            "text": "Стоять на месте и ждать",
            "next": "wait_stay_cross"
          },
          {
            "text": "Побежать в помещение",
            "next": "run_into_room_cross"
          }
        ],
        "add_var1": [
          {
            "text": "Побежать к лестнице вперёд",
            "next": "go_stairs_ahead_cross"
          },
          {
            "text": "Стоять на месте и ждать",
            "next": "wait_stay_cross"
          }
        ],
        "add_var2": [
          {
            "text": "Побежать к лестнице вперёд",
            "next": "go_stairs_ahead_cross"
          },
          {
            "text": "Побежать в помещение",
            "next": "run_into_room_cross"
          }
        ]
      }
    }
  },
  "go_stairs_ahead_cross": {
    "text": "Вы успеваете добежать до лестницы и спуститься на этаж ниже.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "new_floor_cross"
      }
    ]
  },
  "wait_stay_cross": {
    "text": "Вы не двигаетесь с места. Только сердце учащённо бьётся. Тем временем, человек подходит всё ближе к вам. И вы видите, что это какой-то человек с топором. Его форма похожа на сотрудника МЧС или охраны. Он пришёл вас спасти!\n\n— Чего ты ждёшь? Давай за мной. Пошли, пошли!\n\nОн тянет вас вниз, на другой этаж. Тут, кажется, меньше дыма, чем до этого.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "new_floor_cross"
      }
    ]
  },
  "run_into_room_cross": {
    "text": "Инстинктивно вы делаете шаг назад, в помещение. И спрятаться. Так часто делают в разных сериалах про теракты и ЧС, да?\n\nВы молча сидите и ждёте. Но ничего не происходит. Только дым, его всё больше... «Какое-то странное новогоднее пиротехническое шоу» — думаете вы перед тем, как потерять сознание.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "faint_cross"
      }
    ]
  },
  "faint_cross": {
    "text": "Вы потеряли сознание.",
    "type": "game_over"
  },
  "new_floor_cross": {
    "text": "Странно, вы как будто впервые на этом этаже. Всё такое... Мрачное. И холодно. Пахнет свежестью и хвоей. Но нужно решить, что делать дальше. Это место совсем не похоже на тот вуз, к которому вы привыкли.",
    "choices": {
      "variants": {
        "default": [
          {
            "text": "Пойти направо",
            "next": "go_right"
          },
          {
            "text": "Осмотреться",
            "next": "look_around"
          },
          {
            "text": "Пойти налево",
            "next": "go_left"
          }
        ],
        "add_var1": [
          {
            "text": "Осмотреться",
            "next": "look_around"
          },
          {
            "text": "Поговорить со странным человеком",
            "next": "talk_to_man"
          },
          {
            "text": "Убежать",
            "next": "run_away"
          }
        ],
        "add_var2": [
          {
            "text": "Осмотреться",
            "next": "look_around"
          },
          {
            "text": "Поговорить со странным человеком",
            "next": "talk_to_man"
          }
        ],
        "add_var3": [
          {
            "text": "Сразу убежать",
            "next": "run_away"
          },
          {
            "text": "Поговорить со странным человеком",
            "next": "talk_to_man"
          }
        ]
      }
    }
  },
  "go_right": {
    "text": "Вы заходите в какое-то тёмное помещение. Странно, но после этого вы ничего не помните. Возможно, в скором времени вам удастся восстановить воспоминания... (Продолжение следует)",
    "choices": [
      {
        "text": "Завершить",
        "next": "final"
      }
    ]
  },
  "look_around": {
    "text": "Вы решаете, что сначала нужно понять, куда вы попали и что вообще происходит. Замечаете, что этаж всё-таки чуть-чуть похож на привычный. Справа есть дверь в большую аудиторию, слева, длинный коридор. Горит тусклое аварийное освещение. На всех дверях висят только праздничные венки. И тихо-тихо. \n\nПеред вами на доске объявлений висит только одно: «Уважаемые студенты и сотрудники, мы крадём вас из вашего мира, чтобы вы не могли использовать наши ёлки на Новый год. Если хотите вернуться — постарайтесь как можно больше соответствовать атмосфере праздника. Ничему не удивляйтесь, ничего не бойтесь, даже если будет страшно. Только так вы попадёте домой».\n\nХотя погодите? Вдалеке слева вы слышите музыку, похожую на Last Christmas, а справа за стеклом переливаются огни гирлянды. Вы уже хотели пойти в сторону музыки, как кто-то подкрался к вам сзади... (продолжение следует)",
    "choices": [
      {
        "text": "Завершить",
        "next": "final"
      }
    ]
  },
  "go_left": {
    "text": "Вы заходите в какое-то тёмное помещение. Странно, но после этого вы ничего не помните. Возможно, в скором времени вам удастся восстановить воспоминания... (Продолжение следует)",
    "choices": [
      {
        "text": "Завершить",
        "next": "final"
      }
    ]
  },
  "talk_to_man": {
    "text": "Тяжело дыша, вы смотрите на вашего спутника и спрашиваете в недоумении:\n\n— Что это вообще было? Вы... вы кто?\n\nОн как будто совсем не устал, пока тащил вас с этажа на этаж. Как-то странно улыбнулся и повернулся\n\n— Всё ещё не понятно, путник? Ну что ж, я ни в чём не откажу, я ни в чём не откажу...",
    "choices": [
      {
        "text": "Продолжить",
        "next": "who_this_man"
      }
    ]
  },
  "who_this_man": {
    "text": "Чем больше вы присматриваетесь к спутнику, тем более странным он вам кажется. Одежда под хаки, грязные сапоги, топор. Откуда такой человек в вашем вузе? Выглядит подозрительно...",
    "choices": [
      {
        "text": "Убежать",
        "next": "escape"
      },
      {
        "text": "Попробовать узнать больше о спутнике",
        "next": "find_out_more"
      },
      {
        "text": "Попытаться уйти, не вызывая подозрений",
        "next": "try_to_recede"
      }
    ]
  },
  "escape": {
    "text": "Вы пятитесь назад и бежите направо. Оттуда как раз доносится музыка, но вы не можете разобрать, какая. Сзади вы слышите топот тяжёлых ботинок. Получится ли у вас убежать?.. (Продолжение следует)",
    "choices": [
      {
        "text": "Завершить",
        "next": "final"
      }
    ]
  },
  "find_out_more": {
    "text": "— Вы, получается, меня спасли?\n— Всё так, всё так. \n\nВы разговорились со спутником. Оказалось, что это охранник вашего вуза, который очень любит «Короля и Шута». Он увидел, что с вашего этажа ещё не все вышли, заметил вас на пульте и решил помочь. И топор прихватил — если придётся проломить стену или дверь. Вместе с лесником-охранником вы решаете, что делать дальше на этом странном этаже, но это уже другая история (Продолжение следует)",
    "choices": [
      {
        "text": "Завершить",
        "next": "final"
      }
    ]
  },
  "try_to_recede": {
    "text": "— А, вы как лесник из песни «Короля и Шута»?. К... круто...\n\nВы пытаетесь выдавить улыбку и показать, что узнали спутника. Но чем дольше вы рядом с этим человеком, тем страннее он вам кажется. \n\nВы оглядываетесь по сторонам. Замечаете, что этаж всё-таки чуть-чуть похож на привычный. Справа есть дверь в большую аудиторию, слева, длинный коридор. Горит тусклое аварийное освещение. На всех дверях висят только праздничные венки. И тихо-тихо. \n\nПеред вами на доске объявлений висит только одно: «Уважаемые студенты и сотрудники, мы крадём вас из вашего мира, чтобы вы не могли использовать наши ёлки на Новый год. Если хотите вернуться — постарайтесь как можно больше соответствовать атмосфере праздника. Ничему не удивляйтесь, ничего не бойтесь, даже если будет страшно. Только так вы попадёте домой».\n\nХотя погодите? Вдалеке слева вы слышите музыку, похожую на Last Christmas, а справа за стеклом переливаются огни гирлянды. \n\n— Что ж, тогда давайте вы осмотрите вот тот большой зал справа? Там ёлка, вы в них разбираетесь. А я, пожалуй, посмотрю, что в коридоре.\n\nКогда спутник уходит направо, вы резко начинаете бежать налево, как можно дальше от него. Получится ли у вас спастись?.. (Продолжение следует)",
    "choices": [
      {
        "text": "Завершить",
        "next": "final"
      }
    ]
  },
  "find_info_cross": {
    "text": "Вы решаете всё-таки узнать, что случилось с ёлкой. Но как лучше это сделать?",
    "choices": [
      {
        "text": "Поискать новости в интернете",
        "next": "news_cross"
      },
      {
        "text": "Спросить у однокурсников",
        "next": "chat_cross"
      }
    ]
  },
  "news_cross": {
    "text": "Вы вбиваете в строку поиска простой запрос «ёлка в вузе». Новостей пока не так много, но вы замечаете заметку Raschleningrad Daily с интригующим заголовком. Заинтересовавшись, вы кликаете на ссылку и читаете новость.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "news_article_cross"
      }
    ]
  },
  "news_article_cross": {
    "text": "МЕСТЬ ЛЕСНИКА: ЁЛКА ВУЗА ПРИНЕСЕНА В ЖЕРТВУ БАНДЕ ИЗ ЛИХИХ 90-Х?\n\nНа Петроградке творится нечто мрачное и пахнущее хвоей! Готовую к празднику ёлку у ИТМО выкрали таинственные силы. Но это не обычные воры — наши осведомители шепчут о ВОЗВРАЩЕНИИ КРОВАВЫХ «ЛЕСНЫХ МСТИТЕЛЕЙ».\n\nЭта банда, затихшая в «нулевых», снова объявила войну городу! Их почерк узнаваем: на месте — ни единого осколка, только иголки, разбросанные как предупреждение, и загадочные следы, ведущие в тёмный переулок. Легенда гласит, что эти озлобленные лесники похищают ёлки в знак мести за «загубленные» деревья.\n\n«Это они. Это их знак. Городу готовят новогодний кошмар», — цитирует наш источник, близкий к… очень близкий к теням прошлого.\n\nКуда исчезла ель? Версии шокируют: возможно, её уже принесли в жертву в лесу под Питером. Или продают как «освобождённую» на чёрном рынке, где крутятся миллионы! В ИТМО делают вид, что ничего не случилось, но студенты в панике.\n\nПолиция безмолвствует. Но мы-то знаем: если это ОНИ, то это только начало. Готовьтесь — ваша следующая ёлка может стать трофеем в войне между городом и тёмными силами леса.\n\nПодписывайтесь, чтобы первыми узнать леденящие подробности. У вас во дворе тоже пропала ёлка? Скорее пишите нам — мы раскроем этот лесной заговор!",
    "choices": [
      {
        "text": "Продолжить",
        "next": "is_that_true_cross"
      }
    ]
  },
  "is_that_true_cross": {
    "text": "Вы обдумываете новость и решаете, как быть дальше. Поверить ей или нет?",
    "choices": [
      {
        "text": "Принять новость за правду",
        "next": "that_news_true"
      },
      {
        "text": "Проверить новость",
        "next": "check_news"
      }
    ]
  },
  "that_news_true": {
    "text": "Вы решаете поверить заметке. Почему бы и нет? Но надо бы поискать самостоятельно улики, чтобы выяснить, как всё обстояло на самом деле.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "fire_alarm_cross2"
      }
    ]
  },
  "fire_alarm_cross2": {
    "text": "После пары вы решаете зайти в уборную, чтобы привести себя в порядок, обдумать и решить, что делать дальше. Вы замечаете почему-то еловую лапу в урне, а на стекле — узор изморози, хотя только что его не было. «Что происходит?» — думаете вы, но внезапно включается пожарная тревога. Не зная, что делать, вы, сначала мешкаете, но потом всё-таки выходите из уборной.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "corridor_cross"
      }
    ]
  },
  "check_news": {
    "text": "Вы всё-таки засомневались, что заметка правдива. Но не уверены, как проверить это. Между парами вы подходите к преподавателю и спрашиваете, как лучше проверять новости и использовать критическое мышление для этого.\n\n— Ну, для начала я бы советовал вам посмотреть, на кого ссылаются эти журналисты. Есть ли имена авторов цитат? Упоминались ли факты, о которых они писали, где-то ещё? И так далее. То есть, не верьте ни одному факту, пока его не подтвердите.\n\nВы благодарите преподавателя и выходите из аудитории. Кажется, придётся посидеть в библиотеке — подольше погуглить и узнать, как всё было на самом деле.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "ask_guarder"
      }
    ]
  },
  "ask_guarder": {
    "text": "Странный случай и заметка не дают вам успокоиться. Вместо второй пары вы говорите преподавателю, что плохо себя чувствуете, отпрашиваетесь, идёте в библиотеку и начинаете ещё активнее искать информацию в поисковике. \n\nВскоре вам удаётся узнать о том, что лесники — не более чем старая городская легенда одного из районов Санкт-Петербурга. Говорят, её придумали, когда активно вырубали леса, чтобы построить очередной человейник. Так что больше вы не верите в такие истории. А вот во что вы верите — так это в то, что никакой мистики в исчезновении ёлки нет. И другие, более авторитетные люди, в этом разберутся лучше вас.\n\nВидимо, в конце напряжённого года вам всё-таки нужен отдых. Вы решаете пойти домой, но, выходя из корпуса, видите курящего охранника неподалёку от толпы и ёлки.\n\n— Что тут произошло? \n— Вот ж, какой тут случай, что никто не ожидал, что никто не ожидал... Сегодня такой ветер шквалистый был, всё шатало. А ствол был всё-таки больной, больной... Раз — и нет ёлки. Благо, сразу увезли, сразу увезли...\n\nСо спокойной совестью вы идёте домой. С ёлкой и правда разобрались без вас.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "to_leave"
      }
    ]
  },
  "to_leave": {
    "text": "Вы уходите, ведь загадка пропавшей ёлки раскрыта.",
    "choices": [
      {
        "text": "Завершить",
        "next": "final"
      }
    ]
  },
  "chat_cross": {
    "text": "Вы пишете в чат с однокурсниками: «Ребят, кто-то знает, что там с ёлкой?» \n\nНо ответов почти нет. Только кто-то пишет вам в чате, что видел, как странный погрузчик подъезжал к корпусу днём. И мужики какие-то непонятные ходили по корпусу. Вы спрашиваете, что ещё известно об этом, но вам не отвечают. Разочаровавшись, вы продолжаете слушать лекцию.",
    "choices": [
      {
        "text": "Продолжить",
        "next": "fire_alarm_cross1"
      }
    ]
  },
  "final": {
    "text": "Поздравляем! Вы закончили прохождение квеста.",
    "type": "final"}
}


