{
  "start": {
    "text": "Вечером после работы так не хочется идти на пары — вокруг темно и не видно ничего-ничего. Хочется вместо этого пойти домой, включить новогодний фильм и есть сладости под ёлкой. Но вместо этого вы идете в вуз \n\nПальцы мёрзнут, но вы открываете приложение на телефоне, чтобы посмотреть, где пары. Главный экран приложения приветствует вас по имени: «Добрый день!»",
    "choices": [
      { "text": "Продолжить", "next": "player_name" }
    ]
  },

  "player_name": {
    "text": "Кстати, как вас зовут? Напишите ваше имя:",
    "choices": [
      { "text": "Ввести имя", "next": "introduction" }
    ]
  },

  "introduction": {
    "text": "Сегодня пары по критическому мышлению в первом корпусе. Порадовавшись, что не придётся долго идти, вы уже подходите к кампусу. Но странное дело! Перед корпусом толпа людей, полиция, журналисты, а главное - нет высокой украшенной ёлки, к которой вы уже привыкли за прошедшие недели.",
    "choices": [
      { "text": "Продолжить", "next": "journalist" }
    ]
  },

  "journalist": {
    "text": "Один из журналистов замечает ваше удивление и подходит ближе.\n\n— Вы же здесь учитесь, верно? Не могли бы вы дать комментарий для нашего телеграм-канала?",
    "choices": [
      { "text": "Поговорить с журналистом", "next": "talk_to_journalist" },
      { "text": "Отказаться от разговора", "next": "refuse" }
    ]
  },

  "refuse": {
    "text": "— Нет, извините, я опаздываю на пару. \n\nЖурналист ещё хочет что-то сказать, но вы уже заходите в корпус. Самое время - до пары около 10 минут.",
    "choices": [
      { "text": "Продолжить", "next": "wardrobe_refuse" }
    ]
  },

  "talk_to_journalist": {
    "text": "— Да, конечно, а что рассказать?\n\nЖурналист обрадовался вашей отзывчивости и сразу начал расспрашивать вас — где учитесь, на какой программе, видели ли раньше эту ёлку, как отнеслись к утрате. Другой журналист снимает вас на телефон. Вы подробно отвечаете на вопросы, а в конце желаете подписчикам счастливого Нового года и заходите в корпус. Пара уже началась, поэтому вы спешите.",
    "choices": [
      { "text": "Продолжить", "next": "wardrobe_accept" }
    ]
  },

  "wardrobe_refuse": {
    "text": "Оставляя одежду в гардеробе, вы замечаете, что другие студенты перешептываются. Несмотря на другие украшения в холле, новогоднего настроения почти и нет. Вы берёте номерок, подходите к турникету, сканируете пропуск из приложения и проходите в корпус.",
    "choices": [
      { "text": "Войти в аудиторию", "next": "in_class_v1" }
    ]
  },

  "wardrobe_accept": {
    "text": "Оставляя одежду в гардеробе, вы замечаете, что другие студенты перешептываются. Несмотря на другие украшения в холле, новогоднего настроения почти и нет. Вы берёте номерок, подходите к турникету, сканируете пропуск из приложения и проходите в корпус. Приходится быстро идти, чтобы не опоздать ещё больше.",
    "choices": [
      { "text": "Войти в аудиторию", "next": "in_class_v2" }
    ]
  },

  "in_class_v1": {
    "text": "Вы заходите в аудиторию. Преподаватель уже настраивает проектор, но у вас ещё есть время, чтобы выбрать подходящее место и сесть.\n\nКуда вы сядете?",
    "choices": [
      { "text": "Подальше от преподавателя", "next": "far_seat_v1" },
      { "text": "На первый ряд", "next": "close_seat_v1" }
    ]
  },

  "far_seat_v1": {
    "text": "Вы киваете преподавателю и садитесь на предпоследний ряд. Пропавшая ёлка не даёт вам покоя - что бы это могло быть? Как можно её украсть?",
    "choices": [{ "text": "Продолжить", "next": "research_v1" }]
  },

  "close_seat_v1": {
    "text": "Вы здороваетесь и занимаете место перед преподавателем. Пропавшая ёлка не даёт вам покоя - что бы это могло быть? Как можно её украсть?",
    "choices": [{"text": "Продолжить", "next": "cant_research_v1" }]
  },

  "research_v1": {
  "text": "Может, поискать информацию в интернете? Или всё-таки послушать лекцию?",
  "choices": []
},

  "cant_research_v1": {
  "text": "Вам бы хотелось поискать информацию в интернете, но это привлечёт внимание преподавателя. Кажется, загадка пропавшей ёлки так и не будет раскрыта.",
  "choices": []
},

  "in_class_v2": {
    "text": "Чуть-чуть запыхавшись, вы заходите в аудиторию. Преподаватель, прерывая речь на пару секунд, внимательно смотрит на вас, но ничего не говорит и продолжает лекцию. \n\nА вам нужно выбрать, где сесть.",
    "choices": [
      { "text": "Подальше от преподавателя", "next": "far_seat_v2" },
      { "text": "На первый ряд", "next": "close_seat_v2" }
    ]
  },

  "far_seat_v2": {
    "text": "Вы садитесь подальше, стараясь не привлекать внимания. Пара продолжается.",
    "choices": [{"text": "Продолжить", "next": "research_v2" }]
  },

  "close_seat_v2": {
    "text": "Вы садитесь в первый ряд. Преподаватель кидает на вас взгляд, но пара продолжается.",
    "choices": [{"text": "Продолжить", "next": "cant_research_v2" }]
  },

  "research_v2": {
  "text": "Может, поискать информацию в интернете? Или всё-таки послушать лекцию?",
  "choices": []
},

  "cant_research_v2": {
  "text": "Вам бы хотелось поискать информацию в интернете, но это привлечёт внимание преподавателя. Кажется, загадка пропавшей ёлки так и не будет раскрыта.",
  "choices": []
}
}
